Tekla Open API Reference for Tekla Structures 2025
TextElement Constructor
Overload List
Name | Description
TextElement(String)
 Creates a new text element instance with the given textual value.
TextElement(String, FontAttributes)
 Creates a new text element instance with the given textual value and font.
Top
See Also
Reference
TextElement Class
Tekla.Structures.Drawing Namespace